Revit 2015 API
ItemFactoryBase.NewTextNote Method
 Creates a new TextNote object.
Overload List
Name | Description
NewTextNote(View, XYZ, XYZ, XYZ, Double, TextAlignFlags, String)
 Creates a new TextNote object without a leader.
NewTextNote(View, XYZ, XYZ, XYZ, Double, TextAlignFlags, TextNoteLeaderTypes, TextNoteLeaderStyles, XYZ, XYZ, String)
 Creates a new text note with a single leader.
See Also
ItemFactoryBase Class
ItemFactoryBase Members
Autodesk.Revit.Creation Namespace